rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "17"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Some Director'
---
  def director
    @movie = Movie.find(params[:id])

    if !@movie.director or @movie.director.empty?